public/man/man1/flatpak-build-init.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - flatpak-build-init.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - flatpak-build-init.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>flatpak-build-init - Initialize a build directory</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>flatpak build-init</strong> [OPTION…] DIRECTORY APPNAME SDK RUNTIME [BRANCH]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Initializes a separate build directory. DIRECTORY is the name of the
directory. APPNAME is the application id of the app that will be built.
SDK and RUNTIME specify the sdk and runtime that the application should
be built against and run in. BRANCH specify the version of sdk and
runtime</p>
<p>
Initializes a directory as build directory which can be used as target
directory of <strong>flatpak build</strong>. It creates a metadata inside the given
directory. Additionally, empty files and var subdirectories are created.</p>
<p>
It is an error to run build-init on a directory that has already been
initialized as a build directory.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>The following options are understood:</p>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Show help options and exit.</p>
</blockquote>
<p>
<strong>–arch=ARCH</strong></p>
<blockquote>
<p>The architecture to use. See <strong>flatpak –supported-arches</strong> for
architectures supported by the host.</p>
</blockquote>
<p>
<strong>-v</strong>, <strong>–var=RUNTIME</strong></p>
<blockquote>
<p>Initialize var from the named runtime.</p>
</blockquote>
<p>
<strong>-w</strong>, <strong>–writable-sdk</strong></p>
<blockquote>
<p>Initialize /usr with a copy of the sdk, which is writable during flatpak
build. This can be used if you need to install build tools in /usr
during the build. This is stored in the usr subdirectory of the app dir,
but will not be part of the final app.</p>
</blockquote>
<p>
<strong>–tag=TAG</strong></p>
<blockquote>
<p>Add a tag to the metadata file. This option can be used multiple times.</p>
</blockquote>
<p>
<strong>–sdk-extension=EXTENSION</strong></p>
<blockquote>
<p>When using <strong>–writable-sdk</strong>, in addition to the sdk, also install the
specified extension. This option can be used multiple times.</p>
</blockquote>
<p>
<strong>–extension=NAME=VARIABLE[=VALUE]</strong></p>
<blockquote>
<p>Add extension point info.</p>
</blockquote>
<p>
<strong>–sdk-dir</strong></p>
<blockquote>
<p>Specify a custom subdirectory to use instead of usr for
<strong>–writable-sdk</strong>.</p>
</blockquote>
<p>
<strong>–update</strong></p>
<blockquote>
<p>Re-initialize the sdk and var, dont fail if already initialized.</p>
</blockquote>
<p>
<strong>–base=APP</strong></p>
<blockquote>
<p>Initialize the application with files from another specified
application.</p>
</blockquote>
<p>
<strong>–base-version=VERSION</strong></p>
<blockquote>
<p>Specify the version to use for <strong>–base</strong>. If not specified, will default
to &#34;master&#34;.</p>
</blockquote>
<p>
<strong>–base-extension=EXTENSION</strong></p>
<blockquote>
<p>When using <strong>–base</strong>, also install the specified extension from the app.
This option can be used multiple times.</p>
</blockquote>
<p>
<strong>–type=TYPE</strong></p>
<blockquote>
<p>This can be used to build different types of things. The default is
&#34;app&#34; which is a regular app, but &#34;runtime&#34; creates a runtime based on
an existing runtime, and &#34;extension&#34; creates an extension for an app or
runtime.</p>
</blockquote>
<p>
<strong>–extension-tag=EXTENSION_TAG</strong></p>
<blockquote>
<p>If building an extension, the tag to use when searching for the mount
point of the extension.</p>
</blockquote>
<p>
<strong>–verbose</strong></p>
<blockquote>
<p>Print debug information during command processing.</p>
</blockquote>
<p>
<strong>–ostree-verbose</strong></p>
<blockquote>
<p>Print OSTree debug information during command processing.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
EXAMPLES
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p><strong>$ flatpak build-init /build/my-app org.example.myapp org.gnome.Sdk
org.gnome.Platform 3.36</strong></p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
SEE ALSO
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>*flatpak*(1), *flatpak-build*(1), *flatpak-build-finish*(1),
*flatpak-build-export*(1)</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
